DataProcessors/ОбменЭлектроннымиДокументамиСБанком/ОбменЭлектроннымиДокументамиСБанком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменЭлектроннымиДокументамиСБанком</name>
  <comment>Обмен электронными документами с банком (не используется)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеЭД</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выписки</name>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтправки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыпискаБанка</name>
      <type>
        <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

InformationRegisters/СостоянияЭД/СостоянияЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЭД</name>
  <resources>
    <name>СостояниеВерсииЭД</name>
    <type>
      <types>EnumRef.СостоянияВерсийЭД</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСНашейСтороны</name>
    <comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</comment>
    <type>
      <types>EnumRef.СводныеСостоянияЭД</types>
    </type>
  </resources>
  <resources>
    <name>ДействияСоСтороныДругогоУчастника</name>
    <comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</comment>
    <type>
      <types>EnumRef.СводныеСостоянияЭД</types>
    </type>
  </resources>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПроизвольныйЭД</types>
      <types>DocumentRef.ПакетЭД</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>ДопДанные</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>ШтампБанка</name>
  </enumValues>
</mdclass:Enum>

Enums/ПрограммыБанка/ПрограммыБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрограммыБанка</name>
  <enumValues>
    <name>АльфаБанкОнлайн</name>
  </enumValues>
  <enumValues>
    <name>СбербанкОнлайн</name>
  </enumValues>
</mdclass:Enum>

Enums/СостоянияВерсийЭД/СостоянияВерсийЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсийЭД</name>
  <enumValues>
    <name>ЗакрытПринудительно</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеНаПодписи</name>
  </enumValues>
  <enumValues>
    <name>НаПодписи</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяКорректировка</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтправкаИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтправкаПолучателю</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПередачаОператору</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеОператора</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ПлатежИсполнен</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУточнитьДокумент</name>
  </enumValues>
</mdclass:Enum>

Catalogs/СоглашенияОбИспользованииЭД/СоглашенияОбИспользованииЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоглашенияОбИспользованииЭД</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаПакета</name>
    <type>
      <types>EnumRef.ВерсииФорматаПакетаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассивноеСоединениеFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСертификатыПодписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВходящихДокументов</name>
    <type>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсИсходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатКонтрагентаДляШифрования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОрганизацииДляРасшифровки</name>
    <type>
      <types>CatalogRef.СертификатыЭЦП</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСоглашения</name>
    <type>
      <types>EnumRef.СтатусыСоглашенийЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповоеСоглашение</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛогинАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПартнер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатАбонента</name>
    <type>
      <types>CatalogRef.СертификатыЭЦП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнтеркампани</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТиповое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящиеДокументы</name>
    <attributes>
      <name>ВходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭЦП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидатьКвитанциюОДоставке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсходящиеДокументы</name>
    <attributes>
      <name>ИсходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭЦП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидатьКвитанциюОДоставке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияФормата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейКонтрагента</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФорматыФайловОбмена</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматФайла</name>
      <type>
        <types>EnumRef.ФорматыФайловОбменаЭД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейОрганизации</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыЭЦП</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКонтейнера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DataProcessors/ОбменЭлектроннымиДокументамиСБанком/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяОбменЭДСБанками = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции(
																				"ИспользоватьОбменЭДСБанками");
	Если НЕ ИспользуетсяОбменЭДСБанками Тогда
		ТекстСообщения = ЭлектронныеДокументыСлужебныйВызовСервера.ТекстСообщенияОНеобходимостиНастройкиСистемы(
																				"РаботаСБанками");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	Элементы.СтраницыВидыБанковскихСистем.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если Не ПустаяСтрока(Параметры.ОткрытьСтраницу) Тогда
		Элементы.СтраницыОтправкаПолучение.ТекущаяСтраница = Элементы[Параметры.ОткрытьСтраницу];
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПараметры();
	ЗаполнитьТабличныеЧасти();
	ПереключитьСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Элементы.Выписки.Обновить();
	Элементы.ПлатежныеПорученияВОбработке.Обновить();
	ОбновитьЭлектронныеДокументыНаОтправку();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СоглашениеЭДПриИзменении(Элемент)
	
	ЗаполнитьПараметры();
	ЭтаФорма.Модифицированность = Ложь;
	ПереключитьСтраницы();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗапроситьВыписку(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		СообщениеТекст = Нстр("ru = 'Необходимо выбрать период запроса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументыКлиент.ПолучитьВыпискуБанка(Объект.СоглашениеЭД,
													,
													Период.ДатаНачала,
													Период.ДатаОкончания,
													Элементы.Выписки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязи(Команда)
	
	ЭлектронныеДокументыСлужебныйКлиент.ПроверитьНаличиеСвязиСБанком(Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыделенные(Команда)
		
	МассивСтрок = Элементы.ПлатежныеПорученияКОтправке.ВыделенныеСтроки;
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СтрокаТаблицы = ПлатежныеПорученияКОтправке.НайтиПоИдентификатору(НомерСтроки);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Выгружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсехСтрок(Команда)
	
	Для Каждого ТекДокумент Из ПлатежныеПорученияКОтправке Цикл
		Если ТекДокумент.Выгружать Тогда
			ТекДокумент.Выгружать = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтмеченные(Команда)

	МассивОтправки = Новый Массив();
	Для каждого строка из ПлатежныеПорученияКОтправке Цикл
		Если Строка.Выгружать Тогда
			МассивОтправки.Добавить(Строка.ЭлектронныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	КолОтправленных = 0;
	Если МассивОтправки.Количество() > 0 Тогда
		ЭлектронныеДокументыСлужебныйКлиент.ОтправитьПлатежныеПорученияСбербанк(МассивОтправки,
																				КолОтправленных,
																				Объект.СоглашениеЭД);
	КонецЕсли;
	ЗаголовокОповещения = НСтр("ru = 'Обмен электронными документами'");
	
	Если КолОтправленных > 0 Тогда
		ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Отправлено документов: (%1)'"),
															КолОтправленных);
		Оповестить("ОбновитьСостояниеЭД");
	Иначе
		ТекстОповещения = НСтр("ru = 'Отправленных пакетов нет'");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения, , ТекстОповещения);
	
	ОбновитьЭлектронныеДокументыНаОтправку();
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьЭлектронныеДокументыНаОтправку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыписку(Команда)
	
	КаналСоздан = ложь;
	ЭлектронныеДокументыСлужебныйКлиент.УстановитьВиртуальныйКанал(Объект.СоглашениеЭД, КаналСоздан);
	Если НЕ КаналСоздан Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументыСлужебныйКлиент.ОтправитьЗапросНаНочныеВыписки(Объект.СоглашениеЭД);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ЗапросВыписки"));
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ВыпискаБанка"));
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ЗапросНочнойВыписки"));
	ЭлектронныеДокументыСлужебныйКлиент.ОтправитьЗапросНаПолучениеГотовыхВыписок(Объект.СоглашениеЭД);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ВыпискаБанка"));
	Элементы.ВыпискаБанкаСбербанк.Обновить();
	
	ПоследнийЭД = ПоследнийЭД(Объект.СоглашениеЭД);
	
	Если ЗначениеЗаполнено(ПоследнийЭД) ТОгда
		Элементы.ВыпискаБанкаСбербанк.ТекущаяСтрока = ПоследнийЭД;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПолучитьСтатусы(Команда)
	
	КаналСоздан = Ложь;
	ЭлектронныеДокументыСлужебныйКлиент.УстановитьВиртуальныйКанал(Объект.СоглашениеЭД, КаналСоздан);
	Если НЕ КаналСоздан Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьРезультатыОбработкиЗапросов(
												Объект.СоглашениеЭД,
												ПредопределенноеЗначение("Перечисление.ВидыЭД.ПлатежноеПоручение"));
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьСостоянияПлатежныхПоручений(Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВыпискуСбербанк(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		СообщениеТекст = НСтр("ru = 'Необходимо выбрать период запроса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
		
	Если Период.ДатаНачала > Период.ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода должна быть меньше даты окончания'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, , "Период");
		Возврат;
	КонецЕсли;
	
	ЭД = Неопределено;
	
	ЭлектронныеДокументыСлужебныйКлиент.ЗапроситьВыпискуСбербанк(
												Объект.СоглашениеЭД,
												Объект.Организация,
												Период.ДатаНачала,
												Период.ДатаОкончания,
												,
												ЭД);
	
	Элементы.ВыпискаБанкаСбербанк.Обновить();
	
	Если ЗначениеЗаполнено(ЭД) ТОгда
		Элементы.ВыпискаБанкаСбербанк.ТекущаяСтрока = ЭД;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ВыборСтандартногоПериода(ПериодОтбора);
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ВыпискаБанкаСбербанк.Отбор, "ДатаСоздания");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ВыпискаБанкаСбербанк.Отбор,
			"ДатаСоздания",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			ПериодОтбора.ДатаНачала,
			,
			ЗначениеЗаполнено(ПериодОтбора.ДатаНачала));
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ВыпискаБанкаСбербанк.Отбор,
			"ДатаСоздания",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			КонецДня(ПериодОтбора.ДатаОкончания),
			,
			ЗначениеЗаполнено(ПериодОтбора.ДатаОкончания));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыборСтандартногоПериода(Период)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда
		Период = Диалог.Период;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницы()
	
	Если ЗначениеЗаполнено(Объект.СоглашениеЭД) Тогда
		ПрограммаБанка =  ПрограммаБанка(Объект.СоглашениеЭД);
		Если ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.СбербанкОнлайн") Тогда
			Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаСбербанк;
			
			#Если НЕ (ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение) Тогда
				
				Элементы.СтраницыОтправкаПолучение.ТекущаяСтраница    = Элементы.Ошибка;
				Элементы.Ошибка.Видимость                             = Истина;
				Элементы.СтраницыОтправкаПолучение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
				
			#КонецЕсли
			
		Иначе
			Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаТиповой;
		КонецЕсли;
	Иначе
		Элементы.СтраницыВидыБанковскихСистем.ТекущаяСтраница = Элементы.СтраницаТиповой;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры()
	
	Если ЗначениеЗаполнено(Объект.СоглашениеЭД) Тогда
		РеквизитыСоглашения = РеквизитыСоглашения(Объект.СоглашениеЭД);
		Объект.Банк = РеквизитыСоглашения.Контрагент;
		Объект.Организация = РеквизитыСоглашения.Организация;
	Иначе
		Объект.Банк        = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	ВыпискиБанка.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	ВыпискаБанкаСбербанк.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	ПлатежныеПорученияВОбработке.Параметры.УстановитьЗначениеПараметра("СоглашениеЭД", Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрограммаБанка(СоглашениеЭД)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СоглашениеЭД, "ПрограммаБанка");
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыСоглашения(СоглашениеЭД)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СоглашениеЭД, "Организация, Контрагент");
	
КонецФункции

&НаСервере
Процедура ОбновитьЭлектронныеДокументыНаОтправку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияЭД.СсылкаНаОбъект.Контрагент КАК Получатель,
	               |	СостоянияЭД.СсылкаНаОбъект.Номер КАК Номер,
	               |	СостоянияЭД.СсылкаНаОбъект.Дата КАК Дата,
	               |	СостоянияЭД.СсылкаНаОбъект.СуммаДокумента КАК СуммаДокумента,
	               |	СостоянияЭД.СсылкаНаОбъект.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	СостоянияЭД.СсылкаНаОбъект.СчетКонтрагента КАК СчетПолучателя,
	               |	СостоянияЭД.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	               |	СостоянияЭД.СсылкаНаОбъект.СчетОрганизации КАК СчетОрганизации
	               |ИЗ
	               |	РегистрСведений.СостоянияЭД КАК СостоянияЭД
	               |ГДЕ
	               |	СостоянияЭД.СостояниеВерсииЭД = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсийЭД.ОжидаетсяОтправка)
	               |	И СостоянияЭД.ЭлектронныйДокумент.СоглашениеЭД = &СоглашениеЭД
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("СоглашениеЭД", Объект.СоглашениеЭД);
	ПлатежныеПорученияКОтправке.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныеЧасти()
	
	ОбновитьЭлектронныеДокументыНаОтправку();
	УстановитьДоступностьЭлементов();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()

	Элементы.СтраницыВидыБанковскихСистем.Доступность = ЗначениеЗаполнено(Объект.СоглашениеЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеЭДОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.СоглашениеЭД) Тогда
		ОткрытьФорму(
				"Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаБанк",
				Новый Структура("Ключ", Объект.СоглашениеЭД));
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследнийЭД(СоглашениеЭД)
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ЭлектронныйДокумент
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.СоглашениеЭД = &СоглашениеЭД
	|	И (ЭДПрисоединенныеФайлы.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ЗапросВыписки)
	|			ИЛИ ЭДПрисоединенныеФайлы.ВидЭД = ЗНАЧЕНИЕ(Перечисление.ВидыЭД.ВыпискаБанка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания УБЫВ";
	Запрос.УстановитьПараметр("СоглашениеЭД", СоглашениеЭД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭлектронныйДокумент;
	КонецЕсли
	
КонецФункции
